In [ ]:
create table departments(
	dept_no int,
	dept_name VARCHAR
)

In [ ]:
create table department_employees(
	emp_no int not null,
	dept_no VARCHAR(500),
	from_date timestamp,
	to_date timestamp
);

In [ ]:
create table department_managers(
	dept_no VARCHAR(500),
	emo_no int not null,
	from_date timestamp,
	to_date timestamp
);

In [ ]:
create table employees(
	emp_no int not null,
	birth_date timestamp,
	first_name VARCHAR(500),
	last_name VARCHAR(500),
	gender VARCHAR(150),
	hire_date timestamp
);

In [ ]:
create table salaries(
	emp_no int not null,
	salary int not null,
	from_date timestamp,
	to_date timestamp
);

In [ ]:
create table titles(
	emp_no int not null,
	title VARCHAR(500),
	from_date timestamp,
	to_date timestamp
);

In [ ]:
--create First Table

select employees.emp_no, employees.last_name, employees.first_name, employees.gender, salary.salary
from employees
join salaries as salary
on employees.emp_no = salary.emp_no;

In [ ]:
--create Second Table

select hire_date
from employees
where extract(year from hire_date) = '1986';

In [ ]:
--create Third Table

select dm.dept_no, dm.emp_no, e.last_name, e.first_name, dm.from_date, dm.to_date
from department_managers as dm
left join employees as e
on dm.emp_no = e.emp_no;

In [ ]:
--create Fourth Table

select de.emo_no, e.last_name, e.first_name, d.dept_no
from department_employees as de
left join employees as e
on de.emo_no = e.emp_no
left join departments as d
on de.dept_no = d.dept_no;

In [ ]:

--create Fift Table

select * from employees
where(fist_name like 'Hercules' and last_name like '%B%';

In [ ]:
	  
--create Sixth Table
	  
select e.emp_no, e.last_name, e.first_name, d.dept_name
from employees as e
left join department_employees as de
on e.emp_no = de.emo_no
left join departments as d
on d.dept_no = de.dept_no
where d.dept_name like 'Sales';

In [ ]:
	  
--create Seventh Table

select e.emp_no, e.last_name, e.first_name, d.dept_name
from employees as e
left join department_employees as de
on e.emp_no = de.emo_no
left join departments as d
on d.dept_no = de.dept_no
where d.dept_name like 'Sales'
or d.dept_name like 'Development';

In [ ]:
	  
--create Eigth Table
	  
select last_name,
count(last_name) as "name_count"
from employees
group by
last_name
order by name_count desc;